{
  "backend/main.mo": "Main actor for the ICP backend implementing price management and user profile storage with role-based access control (admin/user permissions) using AccessControl and MixinAuthorization mixins.",
  "backend/migration.mo": "Migration module that initializes the new actor state with a fresh AccessControl state and a null price when upgrading from the old (empty) actor shape.",
  "feature_evidence.json": "Feature evidence report mapping the pricing configuration screen feature to its implementation files, component dependencies, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose, covering screens, stores, hooks, components, and mock data modules.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for the full design token system (colors, radius, sidebar, charts) in both light and dark themes.",
  "frontend/index.html": "Minimal HTML shell for the TradeBuddy Vite/React app, mounting the React root and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component managing screen navigation state across all app screens, wrapping the app in ThemeProvider, and passing Internet Identity initialization state to the Welcome screen.",
  "frontend/src/components/charts/MockPriceChart.tsx": "Canvas-based price chart component that renders a line chart with gradient fill, grid lines, and price labels using raw Canvas 2D API without external charting libraries.",
  "frontend/src/components/nav/BottomNav.tsx": "Fixed bottom navigation bar rendering icon-and-label buttons for all main screens, highlighting the active screen using primary color styling.",
  "frontend/src/components/pricing/PricingConfigModal.tsx": "Multi-step dialog modal for configuring app pricing before going live, offering preset tiers (Free, $0.99, $1.99, $4.99) and a custom price input, then confirming and submitting the price via the useSetAppPrice mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing access control with an admin token and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity persistence via AuthClient with configurable options.",
  "frontend/src/hooks/usePriceSimulation.ts": "Custom hook that simulates real-time price movements for a given base price, supporting start/pause/reset controls and configurable speed.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating the app price via a canister actor, with cache invalidation on update.",
  "frontend/src/index.css": "Global CSS file configuring Tailwind base/components/utilities, CSS custom properties for light/dark themes, and custom animations for title and welcome page transitions.",
  "frontend/src/lib/mockData/aiSignals.ts": "Defines the AISignal interface and exports a static array of mock AI trading signals with confidence scores for stocks like AAPL, TSLA, MSFT, and GOOGL.",
  "frontend/src/lib/mockData/learning.ts": "Defines interfaces and exports mock data for learning content including lessons, tutorial videos, and trading tips of varying difficulty levels.",
  "frontend/src/lib/mockData/markets.ts": "Defines interfaces and exports mock market data including market overview indices, trending stocks, major indices, and a watchlist.",
  "frontend/src/lib/mockData/trading.ts": "Defines trading-related interfaces and exports a list of stock options plus a utility function to generate mock historical price data points.",
  "frontend/src/lib/navigation.ts": "Defines the Screen type union and NavItem interface, and exports the navigation items array used for the app's bottom/side navigation.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/Alerts.tsx": "Alerts screen component that displays user-created price alerts and AI signals, with a dialog form to add new price alerts for selected stocks.",
  "frontend/src/screens/DemoTrading.tsx": "A demo trading screen that lets users practice buying and selling stocks with virtual money, displaying account balance, total value, profit/loss, open positions, and trade history using mock stock data.",
  "frontend/src/screens/HomeDashboard.tsx": "The home dashboard screen displaying market overview cards, trending stocks list, major indices, and a watchlist using mock market data.",
  "frontend/src/screens/Learning.tsx": "A learning center screen that renders categorized lessons, video tutorials, and trading tips sourced from mock data with difficulty badges and duration indicators.",
  "frontend/src/screens/LiveChartPractice.tsx": "A simulated live chart practice screen that uses a price simulation hook to animate mock price movements, with start/pause/reset controls and an adjustable speed slider.",
  "frontend/src/screens/ProfileSettings.tsx": "A profile and settings screen allowing users to manage theme, risk level, and notifications, and to view or configure app market pricing via a modal using a fetched price query.",
  "frontend/src/screens/Trading.tsx": "Trading screen component that lets users select a stock, view a mock price chart with timeframe tabs, toggle technical indicators, and enter buy/sell orders with quantity and estimated total.",
  "frontend/src/screens/Welcome.tsx": "Welcome splash screen displaying the TradeBuddy branding and a Continue button with an optional loading spinner state.",
  "frontend/src/state/alertsStore.ts": "Zustand store with localStorage persistence for managing price alerts, supporting add, toggle, and delete operations on alerts tied to stock symbols and price conditions.",
  "frontend/src/state/demoTradingStore.ts": "Zustand store with localStorage persistence for a paper-trading simulation, tracking cash balance, stock positions, trade history, total portfolio value, and profit/loss starting from $100,000.",
  "frontend/src/state/settingsStore.ts": "Zustand store with localStorage persistence for user settings including risk level and notification preferences for price alerts, AI signals, and market news.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radius, box shadow, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata for TradeBuddy tracking schema version, existing features, and pending feature requests including app pricing configuration and backend price persistence for the App Market."
}