{
  "backend/main.mo": "Empty Motoko actor with no methods or state, serving as a placeholder backend.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: Welcome screen navigation (REQ-16) and theme/color palette functionality (REQ-18).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, screens, state management, hooks, and mock data modules.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme CSS variables for the entire application.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the TradeBuddy application.",
  "frontend/src/App.tsx": "Main application component managing screen navigation state, rendering Welcome screen initially, and conditionally displaying BottomNav for non-welcome screens.",
  "frontend/src/components/charts/MockPriceChart.tsx": "Canvas-based price chart component rendering line charts with gradient fills, grid lines, and price labels without external charting dependencies.",
  "frontend/src/components/nav/BottomNav.tsx": "Bottom navigation bar with seven touch-friendly icon buttons showing active state and labels for main app screens.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP actor creation with authentication support, returning actor instance based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/usePriceSimulation.ts": "Custom hook generating simulated real-time price data with playback controls (start/pause/reset) and adjustable speed for practice mode.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file since the prototype uses local mock data and Zustand stores instead of backend queries.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, CSS custom properties for light/dark theme color tokens (using OKLCH color space), and keyframe animations for title entrance and welcome screen effects.",
  "frontend/src/lib/mockData/aiSignals.ts": "Defines AISignal interface and exports mock AI trading signals with bullish/bearish/neutral types, confidence scores, and descriptions for stocks like AAPL, TSLA, MSFT, and GOOGL.",
  "frontend/src/lib/mockData/learning.ts": "Exports mock data for educational content including lessons (with difficulty levels and categories), video tutorials with thumbnails, and trading tips for beginners.",
  "frontend/src/lib/mockData/markets.ts": "Provides mock market data including market overview indices (S&P 500, Nasdaq, etc.), trending stocks, and watchlist items with prices and percentage changes.",
  "frontend/src/lib/mockData/trading.ts": "Defines stock options data and a utility function to generate mock time-series price data with volume for charting purposes.",
  "frontend/src/lib/navigation.ts": "Defines navigation types and exports navigation items array with screen IDs, labels, and icon names for the app's main navigation menu.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/screens/Alerts.tsx": "Alerts screen component that displays AI signals and allows users to create, toggle, and delete price alerts for stocks with customizable conditions (above/below target prices).",
  "frontend/src/screens/DemoTrading.tsx": "Demo trading screen that provides a practice trading interface with virtual money, showing account balance, positions, profit/loss, and allowing users to buy/sell stocks without real financial risk.",
  "frontend/src/screens/HomeDashboard.tsx": "Main dashboard screen displaying market overview cards, trending stocks list with price changes, major indices, and a user watchlist with star icons.",
  "frontend/src/screens/Learning.tsx": "Learning center screen that organizes educational content by category (Basics, Orders, Risk), displays lessons with difficulty badges and duration, and shows video tutorials with thumbnails.",
  "frontend/src/screens/LiveChartPractice.tsx": "Practice mode screen with a simulated price chart, playback controls (start/pause/reset), adjustable simulation speed slider, and educational tips about market behavior observation.",
  "frontend/src/screens/ProfileSettings.tsx": "User settings screen with profile display, dark/light theme toggle, risk level selection (conservative/moderate/aggressive), and notification preferences.",
  "frontend/src/screens/Trading.tsx": "Trading interface with stock selector dropdown, price chart with timeframe tabs (1D/1W/1M/3M), technical indicator toggles, and order entry form for buying/selling stocks.",
  "frontend/src/screens/Welcome.tsx": "Initial welcome screen displaying the TradeBuddy logo, tagline, and a continue button with fade-in animations.",
  "frontend/src/state/alertsStore.ts": "Zustand store managing price alerts with persistence, supporting add/toggle/delete operations for alerts with above/below conditions on stock symbols.",
  "frontend/src/state/demoTradingStore.ts": "Zustand store managing demo trading state with $100k initial balance, positions, trade history, and buy/sell operations that persist to local storage.",
  "frontend/src/state/settingsStore.ts": "Zustand store for user settings including risk level (conservative/moderate/aggressive) and notification preferences, persisted to local storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme tokens for UI components (sidebar, chart, card), and animation utilities.",
  "project_state.json": "Project metadata tracking architectural decisions, features, and known issues for a beginner-friendly trading app prototype with light/dark mode and Welcome screen routing issue."
}